In [3]:
#라이브러리 로드
import pandas as pd

In [2]:
# 스리즈 형태 데이터를 생성
pd_list = pd.Series([5000,6000,65000,65000],index=['아메리카노','카페라떼','카페모카','카푸치노'])

In [3]:
print(pd_list)

아메리카노     5000
카페라떼      6000
카페모카     65000
카푸치노     65000
dtype: int64

In [4]:
print('스리즈 형태의 데이터에서 index의 값은 :', pd_list.index)
print('스리즈 형태의 데이터에서 value의 값은 :', pd_list.values)

스리즈 형태의 데이터에서 index의 값은 : Index(['아메리카노', '카페라떼', '카페모카', '카푸치노'], dtype='object')
스리즈 형태의 데이터에서 value의 값은 : [ 5000  6000 65000 65000]

In [4]:
#2차원 데이터셋
#데이터 프레임 생성
_value = [[1,2,3],[4,5,6],[7,8,9]]
_index = ['a','b','c']
_column = ['A','B','C']

df= pd.DataFrame(value=_value,index = _index, columns = _column)
df

TypeError: DataFrame.__init__() got an unexpected keyword argument 'value'

In [6]:
print("데이터프레임의 인덱스의 값",df.index)
print("데이터프레임의 컬럼의 값", df.columns)
print("데이터프레임의 벨류의 값", df.values)

데이터프레임의 인덱스의 값 Index(['a', 'b', 'c'], dtype='object')
데이터프레임의 컬럼의 값 Index(['A', 'B', 'C'], dtype='object')
데이터프레임의 벨류의 값 [[1 2 3]
 [4 5 6]
 [7 8 9]]

In [7]:
# 딕셔너리 형태의 데이터를 가지고 dataframe 생성
_value ={
    "name" : ["test1","test2",'test3'],
    "age" : [20,30,25],
    "phone" : ["010123456789","01078945613","010879546213"]
}
print(_value)

{'name': ['test1', 'test2', 'test3'], 'age': [20, 30, 25], 'phone': ['010123456789', '01078945613', '010879546213']}

In [8]:
df2=pd.DataFrame(_value)
df2

    name  age         phone
0  test1   20  010123456789
1  test2   30   01078945613
2  test3   25  010879546213

In [9]:
df2['name']

0    test1
1    test2
2    test3
Name: name, dtype: object

### 경로
1. 절대 경로
    - 절대적인 주소? -> 환경이 바뀌더라도 다 같은 위치를 지정하는 절대적인 경로
    - ex) c:/users/user/document/a.txt, 인터넷 url
2. 상대 경로
    - 상대적인 경로
    - 환경에 따라 위치가 달라진다.
    - ./ : 현재 파일의 경로
    - ../ : 현재 경로에서 상위 폴더로 이동
    - 폴더명/ : 해당하는 하위 폴더로 이동

In [10]:
# 코로나 데이터를 로드
# 현재 파일의 경로에서 상위 폴더로 이동 csv 하위 퐁더 이동 -> corona.csv
# 상대 경로로 파일의 위치를 지정
pd.read_csv("../csv/corona.csv")

,Unnamed: 0,createDt,deathCnt,decideCnt,seq,stateDt,stateTime,updateDt,accExamCnt,accDefRate
0,0,2022-06-08 09:09:05.982,24305,18188200,904,20220608,00:00,NaN,NaN,NaN
1,1,2022-06-07 09:09:00.897,24299,18174842,903,20220607,00:00,2022-06-08 09:10:36.846,NaN,NaN
2,2,2022-06-06 09:00:06.734,24279,18168670,902,20220606,00:00,2022-06-08 09:10:50.441,NaN,NaN
3,3,2022-06-05 08:53:19.426,24258,18163648,901,20220605,00:00,2022-06-08 09:11:04.758,NaN,NaN
4,4,2022-06-04 08:56:49.219,24238,18153814,900,20220604,00:00,2022-06-08 09:11:26.303,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
815,815,2020-03-14 00:00:00.000,72,8086,55,20200314,00:00,2021-10-07 10:30:51.51,261335.0,3.318000
816,816,2020-03-13 00:00:00.000,67,7979,54,20200313,00:00,2021-10-07 10:30:51.51,248647.0,3.458499
817,817,2020-03-12 00:00:00.000,66,7869,53,20200312,00:00,2021-10-07 10:30:51.51,234998.0,3.621744
818,818,2020-03-11 00:00:00.000,60,7755,52,20200311,00:00,2021-10-07 10:30:51.51,222395.0,3.804175
819,819,2020-03-10 00:00:00.000,54,7513,51,20200310,00:00,2021-10-07 10:30:51.51,210144.0,3.919308

In [11]:
# 절대 경로로 파일의 위치를 지정
pd.read_csv("C:\\Users\\bjw\\Documents\\test_\\csv\\corona.csv")

,Unnamed: 0,createDt,deathCnt,decideCnt,seq,stateDt,stateTime,updateDt,accExamCnt,accDefRate
0,0,2022-06-08 09:09:05.982,24305,18188200,904,20220608,00:00,NaN,NaN,NaN
1,1,2022-06-07 09:09:00.897,24299,18174842,903,20220607,00:00,2022-06-08 09:10:36.846,NaN,NaN
2,2,2022-06-06 09:00:06.734,24279,18168670,902,20220606,00:00,2022-06-08 09:10:50.441,NaN,NaN
3,3,2022-06-05 08:53:19.426,24258,18163648,901,20220605,00:00,2022-06-08 09:11:04.758,NaN,NaN
4,4,2022-06-04 08:56:49.219,24238,18153814,900,20220604,00:00,2022-06-08 09:11:26.303,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
815,815,2020-03-14 00:00:00.000,72,8086,55,20200314,00:00,2021-10-07 10:30:51.51,261335.0,3.318000
816,816,2020-03-13 00:00:00.000,67,7979,54,20200313,00:00,2021-10-07 10:30:51.51,248647.0,3.458499
817,817,2020-03-12 00:00:00.000,66,7869,53,20200312,00:00,2021-10-07 10:30:51.51,234998.0,3.621744
818,818,2020-03-11 00:00:00.000,60,7755,52,20200311,00:00,2021-10-07 10:30:51.51,222395.0,3.804175
819,819,2020-03-10 00:00:00.000,54,7513,51,20200310,00:00,2021-10-07 10:30:51.51,210144.0,3.919308

In [12]:
# chipotle.tsv 파일을 로드
# 현재 경로에서 상위폴더로 이동 csv하위폴더로 이동 num_1 하위폴더로 이동 이곳에 있는 파일을 로드
pd.read_csv('../csv/num_1/chipotle.tsv', sep="\t")

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [ ]:
#jason 파일 로드
#read_jason()
#csv 폴더 안에 있는 2019파일 하나 오픈
pd.read_json('../csv/2019/201901_expense_list.json')

In [ ]:
# xlsx 파일 로드
# read_excel()
# csv 폴더 안에있는 2020폴더에 파일 하나 오픈
pd.read_excel('../csv/2020/202001_expense_list.xlsx')

In [16]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     -------------------------------------- 250.0/250.0 kB 7.7 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

### 결측치

In [20]:
import pandas as pd
import numpy as np

In [22]:
_value =[
    [1,2,3],
    [4,np.nan,6],
    [7,8,np.nan]
]
df=pd.DataFrame(_value)
df

   0    1    2
0  1  2.0  3.0
1  4  NaN  6.0
2  7  8.0  NaN

In [23]:
# 결측치를 확인
# 데이터 프레임의 정보를 확인한다
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       2 non-null      float64
 2   2       2 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 204.0 bytes

In [27]:
# is()라는 함수를 사용하여 결측치를 확인
# isna()함수사용
df.isna().sum()

0    0
1    1
2    1
dtype: int64

In [29]:
df

   0    1    2
0  1  2.0  3.0
1  4  NaN  6.0
2  7  8.0  NaN

In [30]:
# 결측치를 제거
# dropna는 결측치를 제거하는 함수
# 매개변수 axis : 0, 'rows'을 대입하면 해당하는 행을 삭제
#                1, 'columns'를 대입하면 해당하는 열을 삭제
df.dropna(axis=0) # 결측치가있는 행 전부 삭제

   0    1    2
0  1  2.0  3.0

In [31]:
df.dropna(axis=1) # 결측치가 있는 열 전부 삭제

   0
0  1
1  4
2  7

In [34]:
# sales 데이터 로드
sales = pd.read_csv("../csv/Sales Records.csv")
sales.head(2) #상위에 있는 2줄

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.0
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.5

In [59]:
flg = sales['Region'] == 'Asia' # !=아시아를 제외한 값

In [79]:
# 데이터 프레임 필터 기능 
# loc[행의 조건,열의 조건] , location의 약자
# 행의 조건을 가지고 필터
sales.loc[flg] #  ~(반대)

# 열의 조건을 가지고 필터
sales.loc[flg, ['Region']]


# iloc[행의 위치, 열의 위치]
sales.iloc[1:3, 1:3]

#sales.loc[1:3]

    Country   Item Type
1    Latvia   Beverages
2  Pakistan  Vegetables

In [61]:
sales[['Region']]

                            Region
0               Sub-Saharan Africa
1                           Europe
2     Middle East and North Africa
3               Sub-Saharan Africa
4                           Europe
...                            ...
9995                          Asia
9996                        Europe
9997            Sub-Saharan Africa
9998            Sub-Saharan Africa
9999                          Asia

[10000 rows x 1 columns]

In [85]:
# 결측치가 포함된 데이터만 필터
df.columns = ['A','B','C']
flg_na = df.isna().any(axis=1)

In [87]:
df.loc[~flg_na]

   A    B    C
0  1  2.0  3.0

In [ ]:
sales.isna().sum()

In [90]:
uriage = pd.read_csv("../csv/uriage.csv")

In [91]:
# 결측치 확인 
uriage.isna().sum()

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

In [92]:
uriage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   object
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: float64(1), object(3)
memory usage: 93.8+ KB

In [ ]:
# 결측치가 존재하는 조건 생성
uriage.isna().any(1)

In [95]:
uriage.loc[uriage.isna().any(1)]

C:\Users\bjw\AppData\Local\Temp\ipykernel_25440\3614305374.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  uriage.loc[uriage.isna().any(1)]

         purchase_date item_name  item_price customer_name
1     2019-07-13 13:05     상 품 S         NaN           김우찬
2     2019-05-11 19:42     상 품 a         NaN           김유찬
4      2019-04-22 3:09       상품a         NaN           김강현
6     2019-05-18 19:16      상품 a         NaN           김재준
14    2019-06-11 12:57       상품A         NaN           김재호
...                ...       ...         ...           ...
2987  2019-01-04 13:05       상품K         NaN           김정훈
2990  2019-07-16 11:34       상품O         NaN           김서준
2992  2019-07-27 10:13       상품C         NaN           김동하
2996  2019-03-29 11:14       상품Q         NaN           김지율
2997  2019-07-14 12:56       상품H         NaN           김승주

[387 rows x 4 columns]

In [97]:
uriage.dropna(axis=0)

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
3     2019-02-12 23:40       상품Z      2600.0           김재현
5     2019-03-20 19:16       상품S      1900.0           김우진
7      2019-04-18 0:14       상품V      2200.0           김민혁
8     2019-01-10 15:51       상품O      1500.0           김선우
...                ...       ...         ...           ...
2991  2019-02-18 14:36       상품W      2300.0           김우빈
2993   2019-01-25 3:57       상품C       300.0           김이안
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2998   2019-07-21 0:31       상품D       400.0           정준기

[2612 rows x 4 columns]

In [ ]:
# 통계 요약 정보 출력하는 함수
sales.describe()